
//***************************************************************************
//*практическая работа №9 варииант 8                                        *
//*Выполнил Тарасов Александр группа 2ИСПд                                  *
//*задание составить программу для нахождения минимального элемента массива * 
//                                                                          *
//***************************************************************************
using System;

class Program
{
    static void Main()
    {
        int[] array = new int[10];

        // 1. Ввод элементов массива
        Console.WriteLine("Здравствуйте");
        Console.WriteLine("Введите 10 элементов массива:");
        for (int i = 0; i < array.Length; i++)
        {
            Console.Write($"Элемент {i + 1}: ");
            array[i] = int.Parse(Console.ReadLine());
        }

        // 2. Берем за базовый минимум элемент на первом чётном месте
        int min = array[1];

        // 3. Сравнение четных елементов массива
        for (int i = 1; i < array.Length; i += 2)
        {
            if (array[i] < min)
            {
                min = array[i];
            }
        }

        Console.WriteLine("\nНаименьший элемент на чётном месте: " + min);
    }
}
